www/hadoop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hadoop</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="hadoop"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-02 13:44:11 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">hadoop</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 hadoop</a>
<ul>
<li><a href="#sec-1-1">1.1 FAQ</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Hadoop可以用来做什么</a></li>
<li><a href="#sec-1-1-2">1.1.2 Hadoop包括哪些组件</a></li>
<li><a href="#sec-1-1-3">1.1.3 CDH和Apache Hadoop的关系</a></li>
<li><a href="#sec-1-1-4">1.1.4 搭建单节点集群</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Projects</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> hadoop</h2>
<div class="outline-text-2" id="text-1">


<p>
参考资源
</p><ul>
<li>Cloudera <a href="http://www.cloudera.com/">http://www.cloudera.com/</a>
</li>
<li>Apache Hadoop <a href="http://hadoop.apache.org/">http://hadoop.apache.org/</a>
</li>
<li>Apache Hadoop r1.0.3 文档 <a href="http://hadoop.apache.org/common/docs/r1.0.3/">http://hadoop.apache.org/common/docs/r1.0.3/</a>
</li>
<li>Apache Hadoop r1.0.3 中文文档 <a href="http://hadoop.apache.org/common/docs/r1.0.3/cn">http://hadoop.apache.org/common/docs/r1.0.3/cn</a>
</li>
<li>CDH Downloads <a href="https://ccp.cloudera.com/display/SUPPORT/Downloads">https://ccp.cloudera.com/display/SUPPORT/Downloads</a>
</li>
<li>CDH Documentation <a href="https://ccp.cloudera.com/display/DOC/Documentation">https://ccp.cloudera.com/display/DOC/Documentation</a>
</li>
<li>CDH Tutorial <a href="https://ccp.cloudera.com/display/SUPPORT/Hadoop+Tutorial">https://ccp.cloudera.com/display/SUPPORT/Hadoop+Tutorial</a>
</li>
</ul>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> FAQ</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Hadoop可以用来做什么</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>Why Hadoop? <a href="http://www.cloudera.com/why-hadoop/">http://www.cloudera.com/why-hadoop/</a>
</p>
<p>
TODO(dirlt):translate it!!!
</p>
<p>
Simply put, Hadoop can transform the way you store and process data throughout your enterprise. According to analysts, about 80% of the data in the world is unstructured, and until Hadoop, it was essentially unusable in any systematic way. With Hadoop, for the first time you can combine all your data and look at it as one.
</p><ul>
<li>Make All Your Data Profitable. Hadoop enables you to gain insight from all the data you already have; to ingest the data flowing into your systems 24/7 and leverage it to make optimizations that were impossible before; to make decisions based on hard data, not hunches; to look at complete data, not samples; to look at years of transactions, not days or weeks. In short, Hadoop will change the way you run your organization.
</li>
<li>Leverage All Types of Data, From All Types of Systems. Hadoop can handle all types of data from disparate systems: structured, unstructured, log files, pictures, audio files, communications records, email– just about anything you can think of. Even when different types of data have been stored in unrelated systems, you can dump it all into your Hadoop cluster before you even know how you might take advantage of it in the future.
</li>
<li>Scale Beyond Anything You Have Today. The largest social network in the world is built on the same open-source technology as Hadoop, and now exceeds 100 petabytes. It’s unlikely your organization has that much data. As you need more capacity, you just add more commodity servers and Hadoop automatically incorporates the new storage and compute capacity.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Hadoop包括哪些组件</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>TODO(dirlt):translate it!!!
</p>
<p>
Apache Hadoop包括了下面这些组件：
</p><ul>
<li><a href="http://hadoop.apache.org/common/">Hadoop Common</a> The common utilities that support the other Hadoop subprojects.
</li>
<li><a href="http://hadoop.apache.org/hdfs/">Hadoop Distributed File System(HDFS)</a> A distributed file system that provides high-throughput access to application data.
</li>
<li><a href="http://hadoop.apache.org/mapreduce/">Hadoop MapReduce</a> A software framework for distributed processing of large data sets on compute clusters.
</li>
</ul>

<p>和Apache Hadoop相关的组件有：
</p><ul>
<li><a href="http://avro.apache.org/">Avro</a> A data serialization system.
</li>
<li><a href="http://cassandra.apache.org/">Cassandra</a> A scalable multi-master database with no single points of failure.
</li>
<li><a href="http://incubator.apache.org/chukwa/">Chukwa</a> A data collection system for managing large distributed systems.
</li>
<li><a href="http://hbase.apache.org/">HBase</a> A scalable, distributed database that supports structured data storage for large tables.
</li>
<li><a href="http://hive.apache.org/">Hive</a> A data warehouse infrastructure that provides data summarization and ad hoc querying.
</li>
<li><a href="http://mahout.apache.org/">Mahout</a> A Scalable machine learning and data mining library.
</li>
<li><a href="http://pig.apache.org/">Pig</a> A high-level data-flow language and execution framework for parallel computation.
</li>
<li><a href="http://zookeeper.apache.org/">ZooKeeper</a> A high-performance coordination service for distributed applications.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> CDH和Apache Hadoop的关系</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>CDH Hadoop FAQ <a href="https://ccp.cloudera.com/display/SUPPORT/Hadoop+FAQ">https://ccp.cloudera.com/display/SUPPORT/Hadoop+FAQ</a>
</p>
<p>
TODO(dirlt):translate it!!!
</p>
<ul>
<li>What exactly is included in CDH? / Cloudera's Distribution Including Apache Hadoop (CDH) is a certified release of Apache Hadoop. We include some stable patches scheduled to be included in future releases, as well as some patches we have developed for our supported customers, and are in the process of contributing back to Apache.
</li>
<li>What license is Cloudera's Distribution Including Apache Hadoop released under? / Just like Hadoop, Cloudera's Distribution Including Apache Hadoop is released under the Apache Public License version 2.
</li>
<li>Is Cloudera forking Hadoop? / Absolutely not. Cloudera is committed to the Hadoop project and the principles of the Apache Software License and Foundation. We continue to work actively with current releases of Hadoop and deliver certified releases to the community as appropriate.
</li>
<li>Does Cloudera contribute their changes back to Apache? / We do, and will continue to contribute all eligible changes back to Apache. We occasionally release code we know to be stable even if our contribution to Apache is still in progress. Some of our changes are not eligible for contribution, as they capture the Cloudera brand, or link to our tools and documentation, but these do not affect compatibility with core project.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> 搭建单节点集群</h4>
<div class="outline-text-4" id="text-1-1-4">

<p>搭建单节点集群允许我们在单机做一些模拟或者是测试，还是非常有意义的。如何操作的话可以参考链接 <a href="http://z/home/dirlt/utils/hadoop-0.20.2-cdh3u3/docs/single_node_setup.html">http://z/home/dirlt/utils/hadoop-0.20.2-cdh3u3/docs/single_node_setup.html</a>
这里稍微总结一下：
</p><ul>
<li>首先安装ssh和rsync # sudo apt-get install ssh &amp;&amp;  sudo apt-get install rsync 
</li>
<li>本机建立好信任关系 # cat ~/.ssh/id_dsa.pub &gt;&gt; ~/.ssh/authorized_keys
</li>
<li>将{hadoop-package}/conf配置文件修改如下：
</li>
<li>conf/core-site.xml
</li>
</ul>




<pre class="src src-XML">&lt;configuration&gt;
     &lt;property&gt;
         &lt;name&gt;fs.default.name&lt;/name&gt;
         &lt;value&gt;hdfs://localhost:9000&lt;/value&gt;
     &lt;/property&gt;
&lt;/configuration&gt;
</pre>

<ul>
<li>conf/hdfs-site.xml
</li>
</ul>




<pre class="src src-XML">&lt;configuration&gt;
     &lt;property&gt;
         &lt;name&gt;dfs.replication&lt;/name&gt;
         &lt;value&gt;1&lt;/value&gt;
     &lt;/property&gt;
&lt;/configuration&gt;
</pre>


<ul>
<li>conf/mapred-site.xml
</li>
</ul>




<pre class="src src-XML">&lt;configuration&gt;
     &lt;property&gt;
         &lt;name&gt;mapred.job.tracker&lt;/name&gt;
         &lt;value&gt;localhost:9001&lt;/value&gt;
     &lt;/property&gt;
&lt;/configuration&gt;
</pre>

<ul>
<li>格式化namenode # bin/hadoop namenode -format
</li>
<li>启动hadoop集群 # bin/start-all.sh
</li>
<li>停止hadoop集群 # bin/stop-all.sh
</li>
<li>webconsole
<ul>
<li>NameNode - <a href="http://localhost:50070/">http://localhost:50070/</a> 
</li>
<li>JobTracker - <a href="http://localhost:50030/">http://localhost:50030/</a>
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Projects</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><a href="hdfs.html">hdfs</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-02 13:44:11 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
